In [5]:
# 10 marks
import sqlite3

# Connect to database (or create one)
conn = sqlite3.connect('student.db')
cursor = conn.cursor()

# Create table
cursor.execute('''
CREATE TABLE IF NOT EXISTS student (
    Name TEXT,
    RollNumber INTEGER,
    SAP_ID TEXT,
    Program TEXT,
    Semester TEXT,
    Marks INTEGER,
    Result TEXT
)
''')

# Insert data dynamically from user input
num_students = int(input())
for _ in range(num_students):
    name = input("Enter Student Name: ")
    roll_number = int(input("Enter Roll Number: "))
    sap_id = input("Enter SAP ID: ")
    program = input("Enter Program: ")
    semester = input("Enter Semester (I/II/III): ")
    marks = int(input("Enter Marks: "))
    result = 'Pass' if marks >= 35 else 'Fail'  # Simple pass/fail condition
    
    cursor.execute("INSERT INTO student VALUES (?, ?, ?, ?, ?, ?, ?)",
                   (name, roll_number, sap_id, program, semester, marks, result))

conn.commit()

# Search by Name and SAP_ID
search_name = input("Enter name to search: ")
search_sap_id = input("Enter SAP ID to search: ")
cursor.execute("SELECT * FROM student WHERE Name = ? AND SAP_ID = ?", (search_name, search_sap_id))
print("Search Result:", cursor.fetchall())

# Update marks for a specific student (e.g. Aryan)
update_name = input("Enter name of student to update marks: ")
update_sap_id = input("Enter SAP ID: ")
new_marks = int(input("Enter new marks: "))
new_result = 'Pass' if new_marks >= 35 else 'Fail'
cursor.execute("UPDATE student SET Marks = ?, Result = ? WHERE Name = ? AND SAP_ID = ?",
               (new_marks, new_result, update_name, update_sap_id))
conn.commit()

# Display updated data
cursor.execute("SELECT * FROM student WHERE Name = ? AND SAP_ID = ?", (update_name, update_sap_id))
print("Updated Student Info:", cursor.fetchall())

conn.close()

 3
Enter Student Name:  as
Enter Roll Number:  2
Enter SAP ID:  ada2
Enter Program:  asas
Enter Semester (I/II/III):  2
Enter Marks:  22
Enter Student Name:  dssd
Enter Roll Number:  23
Enter SAP ID:  ad2
Enter Program:  sff
Enter Semester (I/II/III):  1
Enter Marks:  33
Enter Student Name:  sdsd
Enter Roll Number:  23
Enter SAP ID:  sd1
Enter Program:  sdsd
Enter Semester (I/II/III):  2
Enter Marks:  22
Enter name to search:  as
Enter SAP ID to search:  ada2

Search Result: [('as', 2, 'ada2', 'asas', '2', 22, 'Fail')]

Enter name of student to update marks:  as
Enter SAP ID:  ada2
Enter new marks:  444

Updated Student Info: [('as', 2, 'ada2', 'asas', '2', 444, 'Pass')]

In [7]:
import sqlite3

# Connect to database (creates if doesn't exist)
conn = sqlite3.connect('student.db')
cursor = conn.cursor()

# Create table
cursor.execute('''
CREATE TABLE IF NOT EXISTS student (
    Name TEXT,
    RollNumber INTEGER,
    SAP_ID TEXT,
    Program TEXT,
    Semester TEXT,
    Marks INTEGER,
    Result TEXT
)
''')

# Assume values (hardcoded for demo)
students = [
    ('Armaan', 1, 'A001', 'DS', 'I', 80, 'Pass'),
    ('Amit', 2, 'A002', 'CS', 'II', 90, 'Pass'),
    ('Arya', 3, 'A003', 'IT', 'III', 70, 'Pass'),
    ('Aryan', 4, 'A004', 'EXTC', 'I', 20, 'Fail'),
    ('Aman', 5, 'A005', 'MXTC', 'II', 10, 'Fail')
]

# Insert data into table
cursor.executemany("INSERT INTO student VALUES (?, ?, ?, ?, ?, ?, ?)", students)
conn.commit()

# Fetch and print all records
cursor.execute("SELECT * FROM student")
records = cursor.fetchall()

print("\n--- Student Table ---")
print("Name\tRoll No\tSAP ID\tProgram\tSemester\tMarks\tResult")
print("-------------------------------------------------------------")
for row in records:
    print(f"{row[0]}\t{row[1]}\t{row[2]}\t{row[3]}\t{row[4]}\t\t{row[5]}\t{row[6]}")

# Close connection
conn.close()

--- Student Table ---
Name	Roll No	SAP ID	Program	Semester	Marks	Result
-------------------------------------------------------------
Armaan	1	A001	DS	I		80	Pass
Amit	2	A002	CS	II		90	Pass
Arya	3	A003	IT	III		70	Pass
Aryan	4	A004	EXTC	I		75	Fail
Aman	5	A005	MXTC	II		10	Fail
as	2	ada2	asas	2		444	Pass
dssd	23	ad2	sff	1		33	Fail
sdsd	23	sd1	sdsd	2		22	Fail
Armaan	1	A001	DS	I		80	Pass
Amit	2	A002	CS	II		90	Pass
Arya	3	A003	IT	III		70	Pass
Aryan	4	A004	EXTC	I		20	Fail
Aman	5	A005	MXTC	II		10	Fail
Armaan	1	A001	DS	I		80	Pass
Amit	2	A002	CS	II		90	Pass
Arya	3	A003	IT	III		70	Pass
Aryan	4	A004	EXTC	I		20	Fail
Aman	5	A005	MXTC	II		10	Fail

In [8]:
#zip is o zip together multiple lists to create a dataframe or more cols

import pandas as pd

name = ["tejas", "gauir"]
deg = ['cs', 'arts']
scr = [22, 99]
df = pd.DataFrame(list(zip(name, deg, scr)), columns=['Name', "Degree", 'Score'])
df

    Name Degree  Score
0  tejas     cs     22
1  gauir   arts     99